tokihk/sdbox/env/nxp_mimxrt1170_evkb/system_sdsgw_m7/drivers/fsl_enet.c
    enet_tx_bd_ring_t *txBdRing       = &handle->txBdRing[ringId];
    enet_tx_dirty_ring_t *txDirtyRing = &handle->txDirtyRing[ringId];

    status_t result = kStatus_Success;

    /* If tx dirty ring is empty, can set this flag and reset txConsumIdx */
    if ((txDirtyRing->txGenIdx == txDirtyRing->txConsumIdx) && ENET_TxDirtyRingAvailable(txDirtyRing))
    {
        if (isEnable)
        {
            handle->txReclaimEnable[ringId] = true;
            txBdRing->txConsumIdx           = txBdRing->txGenIdx;
        }
        else
        {
            handle->txReclaimEnable[ringId] = false;
        }
    }
    else
    {
        result = kStatus_Fail;
    }
    return result;
}

/*!
 * brief Reclaim tx descriptors.
 * This function is used to update the tx descriptor status and
 * store the tx timestamp when the 1588 feature is enabled.
 * This is called by the transmit interupt IRQ handler after the
 * complete of a frame transmission.
 *
 * param base   ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param ringId The ring index or ring number.
 */
void ENET_ReclaimTxDescriptor(ENET_Type *base, enet_handle_t *handle, uint8_t ringId)
{
    assert(FSL_FEATURE_ENET_INSTANCE_QUEUEn(base) != -1);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_INSTANCE_QUEUEn(base));

    enet_tx_bd_ring_t *txBdRing                  = &handle->txBdRing[ringId];
    volatile enet_tx_bd_struct_t *curBuffDescrip = txBdRing->txBdBase + txBdRing->txConsumIdx;
    enet_tx_dirty_ring_t *txDirtyRing            = &handle->txDirtyRing[ringId];
    enet_frame_info_t *txDirty                   = NULL;
    uint32_t primask;

    /* Need to update the first index for transmit buffer free. */
    while ((0U == (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK)) && (txBdRing->txDescUsed > 0U))
    {
        if ((curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_LAST_MASK) != 0U)
        {
            txDirty                  = txDirtyRing->txDirtyBase + txDirtyRing->txConsumIdx;
            txDirtyRing->txConsumIdx = ENET_IncreaseIndex(txDirtyRing->txConsumIdx, txDirtyRing->txRingLen);
            txDirtyRing->isFull      = false;

#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
            txDirty->isTsAvail = false;
            if ((curBuffDescrip->controlExtend1 & ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK) != 0U)
            {
                enet_ptp_time_t *ts = &txDirty->timeStamp;
                /* Get transmit time stamp second. */
                txDirty->isTsAvail = true;
                ts->second         = handle->msTimerSecond;
                ts->nanosecond     = curBuffDescrip->timestamp;
            }
#endif
            /* For tx buffer free or requeue for last descriptor.
             * The tx interrupt callback should free/requeue the tx buffer. */
            if (handle->callback != NULL)
            {
#if FSL_FEATURE_ENET_QUEUE > 1
                handle->callback(base, handle, ringId, kENET_TxEvent, txDirty, handle->userData);
#else
                handle->callback(base, handle, kENET_TxEvent, txDirty, handle->userData);
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
            }
        }

        primask = DisableGlobalIRQ();
        txBdRing->txDescUsed--;
        EnableGlobalIRQ(primask);

        /* Update the index. */
        txBdRing->txConsumIdx = ENET_IncreaseIndex(txBdRing->txConsumIdx, txBdRing->txRingLen);
        curBuffDescrip        = txBdRing->txBdBase + txBdRing->txConsumIdx;
    }
}

static inline status_t ENET_GetRxFrameErr(enet_rx_bd_struct_t *rxDesc, enet_rx_frame_error_t *rxFrameError)
{
    assert(rxDesc != NULL);
    assert(rxFrameError != NULL);

    status_t result  = kStatus_Success;
    uint16_t control = rxDesc->control;
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
    uint16_t controlExtend1 = rxDesc->controlExtend1;
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

    union _frame_error
    {
        uint32_t data;
        enet_rx_frame_error_t frameError;
    };
    union _frame_error error;

    /* The last buffer descriptor in the frame check the status of the received frame. */
    if (0U != (control & ENET_BUFFDESCRIPTOR_RX_ERR_MASK))
    {
        result = kStatus_ENET_RxFrameError;
    }
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
    else if (0U != (controlExtend1 & ENET_BUFFDESCRIPTOR_RX_EXT_ERR_MASK))
    {
        result = kStatus_ENET_RxFrameError;
    }
    else
    {
        /* Intentional empty */
    }
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

    if (result != kStatus_Success)
    {
        error.data = control;
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
        error.data |= ((uint32_t)controlExtend1 << 16U);
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */
        *rxFrameError = error.frameError;
    }
    else
    {
        (void)memset((void *)rxFrameError, 0, sizeof(enet_rx_frame_error_t));
    }

    return result;
}

/*!
 * brief Receives one frame in specified BD ring with zero copy.
 *
 * This function uses the user-defined allocation and free callbacks. Every time application gets one frame through
 * this function, driver stores the buffer address(es) in enet_buffer_struct_t and allocate new buffer(s) for the BD(s).
 * If there's no memory buffer in the pool, this function drops current one frame to keep the Rx frame in BD ring is as
 * fresh as possible.
 * note Application must provide a memory pool including at least BD number + n buffers in order for this function to work
 * properly, because each BD must always take one buffer while driver is running, then other extra n buffer(s) can be taken
 * by application. Here n is the ceil(max_frame_length(set by RCR) / bd_rx_size(set by MRBR)). Application must also provide
 * an array structure in rxFrame->rxBuffArray with n index to receive one complete frame in any case.
 *
 * param base   ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param rxFrame The received frame information structure provided by user.
 * param ringId The ring index or ring number.
 * retval kStatus_Success  Succeed to get one frame and allocate new memory for Rx buffer.
 * retval kStatus_ENET_RxFrameEmpty  There's no Rx frame in the BD.
 * retval kStatus_ENET_RxFrameError  There's issue in this receiving.
 * retval kStatus_ENET_RxFrameDrop  There's no new buffer memory for BD, drop this frame.
 */
status_t ENET_GetRxFrame(ENET_Type *base, enet_handle_t *handle, enet_rx_frame_struct_t *rxFrame, uint8_t ringId)
{
    assert(handle != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);
    assert(handle->rxBdRing[ringId].rxBdBase != NULL);
    assert(rxFrame != NULL);
    assert(rxFrame->rxBuffArray != NULL);

    status_t result                              = kStatus_ENET_RxFrameEmpty;
    enet_rx_bd_ring_t *rxBdRing                  = &handle->rxBdRing[ringId];
    volatile enet_rx_bd_struct_t *curBuffDescrip = rxBdRing->rxBdBase + rxBdRing->rxGenIdx;
    bool isLastBuff                              = false;
    uintptr_t newBuff                            = 0;
    uint16_t buffLen                             = 0;
    enet_buffer_struct_t *rxBuffer;
    uintptr_t address;
    uintptr_t buffer;
    uint16_t index;

