tokihk/sdbox/env/nxp_mimxrt1170_evkb/system_sdsgw_m7/drivers/fsl_enet.c
void ENET_RxIRQHandler(ENET_Type *base);
void ENET_RxIRQHandler(ENET_Type *base)
{
    uint32_t instance = ENET_GetInstance(base);

    if (s_enetRxIsr[instance] != NULL)
    {
        s_enetRxIsr[instance](base, s_ENETHandle[instance]);
    }
}

void ENET_ErrIRQHandler(ENET_Type *base);
void ENET_ErrIRQHandler(ENET_Type *base)
{
    uint32_t instance = ENET_GetInstance(base);

    if (s_enetErrIsr[instance] != NULL)
    {
        s_enetErrIsr[instance](base, s_ENETHandle[instance]);
    }
}

void ENET_Transmit_DriverIRQHandler(void);
void ENET_Transmit_DriverIRQHandler(void)
{
    ENET_TxIRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}

void ENET_Receive_DriverIRQHandler(void);
void ENET_Receive_DriverIRQHandler(void)
{
    ENET_RxIRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}

void ENET_Error_DriverIRQHandler(void);
void ENET_Error_DriverIRQHandler(void)
{
    ENET_ErrIRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}
#else

void ENET_MAC0_Rx_Tx_Done1_DriverIRQHandler(void);
void ENET_MAC0_Rx_Tx_Done1_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_MAC0_Rx_Tx_Done2_DriverIRQHandler(void);
void ENET_MAC0_Rx_Tx_Done2_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}
#endif

void ENET_DriverIRQHandler(void);
void ENET_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}

void ENET_1588_Timer_DriverIRQHandler(void);
void ENET_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}

void ENET_TIMER_DriverIRQHandler(void);
void ENET_TIMER_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET */

#if defined(ENET1)
void ENET1_DriverIRQHandler(void);
void ENET1_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET1 */

#if defined(ENET2)
void ENET2_DriverIRQHandler(void);
void ENET2_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET2);
    SDK_ISR_EXIT_BARRIER;
}

void ENET2_1588_Timer_DriverIRQHandler(void);
void ENET2_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET2);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET2 */

#if defined(CONNECTIVITY__ENET0)
void CONNECTIVITY_ENET0_FRAME0_EVENT_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME0_EVENT_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
#if FSL_FEATURE_ENET_QUEUE > 1
void CONNECTIVITY_ENET0_FRAME1_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME1_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET0_FRAME2_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME2_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET0_TIMER_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_TIMER_INT_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(CONNECTIVITY__ENET0);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
#endif /* CONNECTIVITY__ENET0 */
#if defined(CONNECTIVITY__ENET1)
void CONNECTIVITY_ENET1_FRAME0_EVENT_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME0_EVENT_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#if FSL_FEATURE_ENET_QUEUE > 1
void CONNECTIVITY_ENET1_FRAME1_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME1_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET1_FRAME2_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME2_INT_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void CONNECTIVITY_ENET1_TIMER_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_TIMER_INT_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(CONNECTIVITY__ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
#endif /* CONNECTIVITY__ENET1 */
#if FSL_FEATURE_ENET_QUEUE > 1
#if defined(ENET_1G)
void ENET_1G_DriverIRQHandler(void);
void ENET_1G_DriverIRQHandler(void)
{
    ENET_CommonFrame0IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_1G_MAC0_Tx_Rx_1_DriverIRQHandler(void);
void ENET_1G_MAC0_Tx_Rx_1_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_1G_MAC0_Tx_Rx_2_DriverIRQHandler(void);
void ENET_1G_MAC0_Tx_Rx_2_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
void ENET_1G_1588_Timer_DriverIRQHandler(void);
void ENET_1G_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET_1G);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET_1G */

#if defined(ENET1)
void ENET1_MAC0_Rx_Tx_Done1_DriverIRQHandler(void);
void ENET1_MAC0_Rx_Tx_Done1_DriverIRQHandler(void)
{
    ENET_CommonFrame1IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void ENET1_MAC0_Rx_Tx_Done2_DriverIRQHandler(void);
void ENET1_MAC0_Rx_Tx_Done2_DriverIRQHandler(void)
{
    ENET_CommonFrame2IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
void ENET1_1588_Timer_DriverIRQHandler(void);
void ENET1_1588_Timer_DriverIRQHandler(void)
{
    ENET_Ptp1588IRQHandler(ENET1);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* ENET1 */
#endif /* FSL_FEATURE_ENET_QUEUE > 1 */
